=begin

Обслуживать стелажи можно с двух сторон. Поэтому нет необходимости проходить по самому дальнему проходу.
Можно пройти между 2 и 3 рядами стелажей. Чтобы обслужить 1  ряд стелажей, можно пройти по первому 
проходу или по повторому проходу, который между 1 и 2 рядами стелажей. 
Но если у кладовщика есть задача забрать, что то только с 1 и 2 
рядов стелажей то самый эфективный маршрут будет, как раз между 1 и 2 стелажом.

Самый оптимизированный маршрут будет следующий
Кладовщик поднимается от стола на уровень прохода между 1 и 2 рядов стелажей. Проходит весь ряд. Далее 
он поднимается на уровень прохода между 2 и 3 рядов стелажей. 
Проходит весь ряд стелажей и возвращается к столу.

=end